Конфигурация/Documents/Сделка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Сделка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>InformationRegister.УсловияСделок</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииСрочныхКонтрактов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.РаспределенияАктивовЕПС</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагам</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПоСделке</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРасчетовНаБирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимБиржевыхТоргов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыБиржевыхТоргов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеполныеЛоты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПереговорныхСделок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаБирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыкупЭмитентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичноеРазмещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Comment>При установленном флаге документ создает задолженность по ц/б и д/с, при сброшенном — двигает остатки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаздельноеИсполнение</Name>
					<Comment>Оплата и поставка при отложенном исполнении планируются в разные дни</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеннаяОплатаТорговойКомиссии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыТорговойКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаТорговойКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Comment>Для внебиржевых сделок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриобретениеПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПорученияУБрокера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПорученияУБрокера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПроцент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаКомиссии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Сделка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОписаниеРеквизитовБиржевойСделки(Форма, ДанныеОбъекта)
	
	// :)) Сделка № [345769312] на бирже [ММВБ] с контрагентом ["ООО Вечный Отдых"], [15:30:30]
	// Код расчетов [Т+], режим переговорных сделок (РПС), выкуп эмитентом, первичное размещение
	Форма.Элементы.ОписаниеРеквизитовБиржевойСделки.Заголовок =
		"Сделка № " + ?(ЗначениеЗаполнено(ДанныеОбъекта.НомерСделки), ДанныеОбъекта.НомерСделки, "<Не задан>")
			+ " на бирже " + ?(ЗначениеЗаполнено(ДанныеОбъекта.МестоХранения), Строка(ДанныеОбъекта.МестоХранения), "<Не задана>")
			+ ?(ПустаяСтрока(ДанныеОбъекта.КонтрагентНаБирже), "", " с контрагентом " + Строка(ДанныеОбъекта.КонтрагентНаБирже))
			+ ", " + ?(ДанныеОбъекта.ВремяСделки = Дата(1, 1, 1), "<Время сделки не задано>", Формат(ДанныеОбъекта.ВремяСделки, "ДФ=ЧЧ:мм:сс")) + ","
			+ Символы.ПС
			+ ?(ПустаяСтрока(ДанныеОбъекта.КодРасчетовНаБирже), "", "Код расчетов " + ДанныеОбъекта.КодРасчетовНаБирже)
			+ ?(ПустаяСтрока(ДанныеОбъекта.РежимБиржевыхТоргов), "", ", режим торгов " + ДанныеОбъекта.РежимБиржевыхТоргов)
			+ ?(Не ДанныеОбъекта.НеполныеЛоты, "", ", неполные лоты")
			+ ?(Не ДанныеОбъекта.РежимПереговорныхСделок, "", ", режим переговорных сделок (РПС)")
			+ ?(Не ДанныеОбъекта.ВыкупЭмитентом, "", ", выкуп эмитентом")
			+ ?(Не ДанныеОбъекта.ПервичноеРазмещение, "", ", первичное размещение");
				
КонецПроцедуры // ЗаполнитьОписаниеРеквизитовБиржевойСделки

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы      = Форма.Элементы;
	
	ЭтоРынокДолей = (ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли"));
	Элементы.ВнебиржеваяСделка.Доступность = Не ЭтоРынокДолей;
	
	// биржа/внебиржа
	Элементы.ГруппаРеквизитыБиржевойСделки.Видимость = Не Форма.ВнебиржеваяСделка;
	Элементы.ВыкупЭмитентом.Видимость				 = Форма.ВнебиржеваяСделка;
	Элементы.ПлатежноеУсловиеСделки.Видимость		 = Форма.ВнебиржеваяСделка;
	Элементы.ГруппаРеквизитыПоручения.Видимость      = Форма.ВнебиржеваяСделка И (Форма.СделкаЧерезБрокера = 1);
	Элементы.ОтложенноеИсполнение.Доступность        = Не Форма.ВнебиржеваяСделка; // "отлож. исполнение", в терминологии бэк-офиса, означает исполнение в другой день; в тикете же мгновенного исполнения не бывает
	
	// режимы и даты исполнения
	Элементы.РаздельноеИсполнение.Видимость = ДанныеОбъекта.ОтложенноеИсполнение;
	
	Элементы.ДатаИсполнения.Видимость = ДанныеОбъекта.ОтложенноеИсполнение И Не ДанныеОбъекта.РаздельноеИсполнение;
	Элементы.ДатаОплаты.Видимость     = ДанныеОбъекта.РаздельноеИсполнение;
	Элементы.ДатаПоставки.Видимость   = ДанныеОбъекта.РаздельноеИсполнение;
	
	// курс оплаты
	Элементы.ГруппаСобственныйКурсВалютыОплаты.Видимость = ЗначениеЗаполнено(ДанныеОбъекта.ВалютаСделки) И ЗначениеЗаполнено(ДанныеОбъекта.ВалютаОплаты)
									И ДанныеОбъекта.ВалютаСделки <> ДанныеОбъекта.ВалютаОплаты И Форма.ВнебиржеваяСделка;
	Элементы.ВалютаОплаты.Доступность = Форма.ВнебиржеваяСделка;								
	Элементы.КурсОплаты.Доступность   = ДанныеОбъекта.СобственныйКурсОплаты;
	Элементы.ГруппаСуммыВВалютеОплаты.Видимость = Элементы.ГруппаСобственныйКурсВалютыОплаты.Видимость;
	
	Элементы.ЦенныеБумагиСуммаКупонаВВалютеОплаты1.Видимость = (Элементы.ГруппаСобственныйКурсВалютыОплаты.Видимость 
																	И ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"));
	
	// прочие
	Элементы.ГруппаРеквизитыКонтрагентаВнебиржевойСделки.Видимость = Форма.ВнебиржеваяСделка И ЗначениеЗаполнено(ДанныеОбъекта.Контрагент);

	//торговая комиссия
	Элементы.ГруппаУчетТорговойКомиссии.Видимость    = Не Форма.ВнебиржеваяСделка;
	Элементы.ЦенныеБумагиТорговаяКомиссия.Видимость  = (Форма.ВариантыОплатыТорговойКомиссииБезДаты = 2 Или Форма.ВариантОплатыТорговойКомиссииСДатой = 1);
	Элементы.ЦенныеБумагиТорговаяКомиссия1.Видимость = (Форма.ВариантыОплатыТорговойКомиссииБезДаты = 2 Или Форма.ВариантОплатыТорговойКомиссииСДатой = 1);
	Элементы.ВалютаТорговойКомиссии.Видимость        = (Форма.ВариантыОплатыТорговойКомиссииБезДаты = 2 Или Форма.ВариантОплатыТорговойКомиссииСДатой = 1);
	Элементы.ДатаОплатыТорговойКомиссии.Видимость    = (Форма.ВариантОплатыТорговойКомиссииСДатой = 1);
	
	ЭтоРынокДеривативов = (ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы") 
							Или ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Опционы")
							Или ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы"));
							
	Элементы.ВнебиржеваяСделка.Видимость 	  = Не ЭтоРынокДеривативов;
	Элементы.СделкаЧерезБрокера.Доступность   = Не ЭтоРынокДеривативов;

	РаботаСДокументамиКлиентСервер.НастроитьВидимостьБрокераСделкиИСвязанныхРеквизитов(Форма);
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);
	
	Элементы.ЦенныеБумагиЦена.Видимость  = Не ЭтоРынокДолей;
	Элементы.ЦенныеБумагиЦена1.Видимость = Не ЭтоРынокДолей;
	Элементы.ПриобретениеПаев.Видимость	 = Форма.ВнебиржеваяСделка
											И ДанныеОбъекта.ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка")
											И ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи");
		
	Элементы.ДекорацияАкцептовано.Видимость = (ЗначениеЗаполнено(ДанныеОбъекта.Ссылка) И РаботаСДокументами.ДокументАкцептован(ДанныеОбъекта.Ссылка, ДанныеОбъекта.Организация));
	
	Элементы.ОписаниеНоминалаЦеннойБумаги.Видимость = РаботаСЦеннымиБумагамиКлиентСервер.ЭтоРынокЦенныхБумагСНоминалом(ДанныеОбъекта.Рынок);
	
	Если Форма.Модифицированность Тогда //удаление значений скрываемых полей
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();
			
		ПутьКДаннымСкрываемыхПолей.Вставить("ДатаОплатыТорговойКомиссии", "Объект.ДатаОплатыТорговойКомиссии");
		ПутьКДаннымСкрываемыхПолей.Вставить("ВалютаТорговойКомиссии", "Объект.ВалютаТорговойКомиссии");
		ПутьКДаннымСкрываемыхПолей.Вставить("ПлатежноеУсловиеСделки", "Объект.ПлатежноеУсловиеСделки");	
		ПутьКДаннымСкрываемыхПолей.Вставить("ОтложенноеИсполнение", "Объект.ОтложенноеИсполнение");
		ПутьКДаннымСкрываемыхПолей.Вставить("РаздельноеИсполнение", "Объект.РаздельноеИсполнение");
		ПутьКДаннымСкрываемыхПолей.Вставить("ПриобретениеПаев", "Объект.ПриобретениеПаев");
		ПутьКДаннымСкрываемыхПолей.Вставить("ВыкупЭмитентом", "Объект.ВыкупЭмитентом");
		ПутьКДаннымСкрываемыхПолей.Вставить("ДатаИсполнения", "Объект.ДатаИсполнения");
		ПутьКДаннымСкрываемыхПолей.Вставить("ДатаПоставки", "Объект.ДатаПоставки");
 		ПутьКДаннымСкрываемыхПолей.Вставить("ДатаОплаты", "Объект.ДатаОплаты");
		ПутьКДаннымСкрываемыхПолей.Вставить("Брокер", "Объект.Брокер");		
		
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаСобственныйКурсВалютыОплаты", "Объект.КурсОплаты");
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаСобственныйКурсВалютыОплаты", "Объект.СобственныйКурсОплаты");

		МассивРеквизитыКонтрагентаВнебиржевойСделки = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.ДепозитарныйСчетКонтрагента, Объект.РасчетныйСчетКонтрагента, Объект.Договор, Объект.НомерДоговораКонтрагента", ",", Истина, Истина);
		МассивРеквизитыБиржевойСделки  = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.НомерСделки, Объект.ВремяСделки, Объект.КодРасчетовНаБирже, Объект.РежимБиржевыхТоргов, Объект.КонтрагентНаБирже, Объект.НеполныеЛоты, Объект.РежимПереговорныхСделок, Объект.ПервичноеРазмещение, Объект.ПриобретениеПаев", ",", Истина, Истина);
		
		Если Не Форма.ВнебиржеваяСделка Тогда //для внебиржевой сделки значение скрыто с формы, очищать значение не нужно.
			МассивРеквизитыБиржевойСделки.Добавить("Объект.МестоХранения");	
		КонецЕсли;
		
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаРеквизитыКонтрагентаВнебиржевойСделки", МассивРеквизитыКонтрагентаВнебиржевойСделки);
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаРеквизитыБиржевойСделки", МассивРеквизитыБиржевойСделки);
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаРеквизитыПоручения", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.ДатаПорученияУБрокера, Объект.НомерПорученияУБрокера", ",", Истина, Истина));
				
		Если Форма.КорзинаЦенныхБумаг Тогда
			ПутьКДаннымСкрываемыхПолей.Вставить("ЦенныеБумагиТорговаяКомиссия", "Объект.ЦенныеБумаги.ТорговаяКомиссия");
			ПутьКДаннымСкрываемыхПолей.Вставить("ЦенныеБумагиЦена", "Объект.ЦенныеБумаги.Цена");
		Иначе
			ПутьКДаннымСкрываемыхПолей.Вставить("ЦенныеБумагиТорговаяКомиссия1", "ЦенныеБумагиТорговаяКомиссия1");
			ПутьКДаннымСкрываемыхПолей.Вставить("ЦенныеБумагиЦена1", "ЦенныеБумагиЦена1");
		КонецЕсли;
		                                               
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);	
	КонецЕсли;
	
КонецПроцедуры // НастроитьВидимостьИДоступность

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммыВВалютеОплаты(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	
	Если ДанныеОбъекта.ВалютаСделки = ДанныеОбъекта.ВалютаОплаты Тогда	
		ДанныеОбъекта.КурсОплаты 			= Неопределено;
		ДанныеОбъекта.СобственныйКурсОплаты = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.ВалютаСделки) Тогда
		Возврат;
	КонецЕсли;
		
	КурсВалютыОплаты = ?(ДанныеОбъекта.СобственныйКурсОплаты, ДанныеОбъекта.КурсОплаты, ДанныеОбъекта.Дата);
	Коэфициент = РаботаСВалютами.ПересчетСуммыВВалюте(1, ДанныеОбъекта.ВалютаСделки, КурсВалютыОплаты, ДанныеОбъекта.ВалютаОплаты, ДанныеОбъекта.Дата); 

	Форма.ЦенныеБумагиСуммаВВалютеОплаты1       = Форма.ЦенныеБумагиСумма1       * Коэфициент;
	Форма.ЦенныеБумагиСуммаКупонаВВалютеОплаты1 = Форма.ЦенныеБумагиСуммаКупона1 * Коэфициент;
	Форма.ЦенныеБумагиСуммаВсегоВВалютеОплаты1  = Форма.ЦенныеБумагиСуммаВсего1  * Коэфициент;

КонецПроцедуры // РассчитатьСуммыВВалютеОплаты

&НаСервере
Процедура ОчиститьКоличествоИЦену();
	
	Для Каждого ТекСтрока Из Объект.ЦенныеБумаги Цикл
		ТекСтрока.Количество	= 0;
		ТекСтрока.Цена			= 0;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере(ИдСтрокиКорзины = Неопределено) Экспорт
	
	НомерСтрокиКорзины = ?(ИдСтрокиКорзины = Неопределено, Неопределено,
		Объект.ЦенныеБумаги.Индекс(Объект.ЦенныеБумаги.НайтиПоИдентификатору(ИдСтрокиКорзины)));
	
	//РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьНоминалыЦенныхБумагИСуммыВсего(ЭтаФорма, Объект,, НомерСтрокиКорзины);
	
КонецПроцедуры // ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.ВнебиржеваяСделка            = (Объект.МестоХранения = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок"));
	ЭтаФорма.СделкаЧерезБрокера           = ?(ЗначениеЗаполнено(Объект.Брокер), 1, 0);
	ЭтаФорма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	
	ОбщаяСуммаТорговойКомиссии = Объект.ЦенныеБумаги.Итог("ТорговаяКомиссия");
	
	Если ОбщаяСуммаТорговойКомиссии > 0 Тогда
		Если Объект.ОтложеннаяОплатаТорговойКомиссии Тогда
			ЭтаФорма.ВариантОплатыТорговойКомиссииСДатой = 1;
		Иначе
			ЭтаФорма.ВариантыОплатыТорговойКомиссииБезДаты = 2;
		КонецЕсли;
	Иначе
		ЭтаФорма.ВариантыОплатыТорговойКомиссииБезДаты = 1;
	КонецЕсли;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		ЭтаФорма.Элементы.КомандаИзменитьРеквизитыБиржевойСделки.Заголовок = "Открыть";	
	КонецЕсли;
	
	Если Не ЭтаФорма.ВнебиржеваяСделка Тогда
		ЗаполнитьОписаниеРеквизитовБиржевойСделки(ЭтаФорма, Объект);
	КонецЕсли;
			
	РаботаСКорзинойЦенныхБумагКлиентСервер.НастроитьОтображение(ЭтаФорма, Истина);
	
	РассчитатьСуммыВВалютеОплаты(ЭтаФорма);
			
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ЭтаФорма.РаскрытыйКонтрагент = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(Неопределено, "_РаскрытыйКонтрагент", Объект.Ссылка);
		
		Если ЗначениеЗаполнено(ЭтаФорма.РаскрытыйКонтрагент) Тогда
			ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = ЭтаФорма.РаскрытыйКонтрагент;
		Иначе
			ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = "Выбрать";
		КонецЕсли;

	КонецЕсли;
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЭтаФорма.ВидСделки = "Купля-продажа";
	
	Если ЗначениеЗаполнено(Объект.ВалютаСделки) Тогда
		ЭтаФорма.Элементы.ГруппаВВалютеСделки.Заголовок = "В валюте сделки (" + Объект.ВалютаСделки + ")";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВалютаОплаты) Тогда
		ЭтаФорма.Элементы.ГруппаСуммыВВалютеОплаты.Заголовок = "В валюте оплаты (" + Объект.ВалютаОплаты + ")";	
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()
	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// т.к. страницами удобно пользоваться на этапе разработки, отключим их на этапе исполнения
	Элементы.ГруппаЦенныеБумаги.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ПриЧтенииСозданииНаСервере();
	
	РаботаСФормами.ЗаполнитьДополнительныеСвязиИПараметрыВыбора(Элементы.Договор, "СчетДоверительногоУправления");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекДепозитарныйСчет = Неопределено;
	
	Если Не ЭтаФорма.КорзинаЦенныхБумаг Тогда
		РаботаСКорзинойЦенныхБумагКлиентСервер.ПеренестиРеквизитыИзФормыВТаблицу(ЭтаФорма);
	КонецЕсли;
		
	Если Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы") 
		Или Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Опционы")
		Или Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы")Тогда
		
		ТекДепозитарныйСчет = ПредопределенноеЗначение("Справочник.ДепозитарныеСчета.СчетУчетаДеривативов");
		
	ИначеЕсли Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли") Тогда
		
		ТекДепозитарныйСчет = ПредопределенноеЗначение("Справочник.ДепозитарныеСчета.СчетУчетаДолей");
		
	КонецЕсли;
	
	Если ТекДепозитарныйСчет <> Неопределено Тогда
	
		Для Каждого СтрокаЦенныхБумаг Из Объект.ЦенныеБумаги Цикл
			СтрокаЦенныхБумаг.ДепозитарныйСчет = ТекДепозитарныйСчет;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(ЭтаФорма.РаскрытыйКонтрагент) Тогда
		ПараметрыЗаписи.Вставить("РаскрытыйКонтрагентВДопСведения");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// после записи теряются значения реквизитов, добавленных к т.ч. объекта
	Если ЭтаФорма.КорзинаЦенныхБумаг Тогда
		ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	КонецЕсли;

	ЗаполнитьПодтверждениеОперацииНаСервере();
	
	Если ПараметрыЗаписи.Свойство("РаскрытыйКонтрагентВДопСведения") Тогда
		РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Объект.Ссылка, "_РаскрытыйКонтрагент", ЭтаФорма.РаскрытыйКонтрагент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперациинаСервере();
		КонецЕсли;
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("СводнаяБиржеваяСделка.Обновить", Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель(?(ЭтаФорма.СделкаЧерезБрокера = 1, "ИсполнителиПоДенежнымСредствамБрокерские", "ИсполнителиПоДенежнымСредствамСобственные"),
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ПриИзмененииДаты(ЭтаФорма);
	
	РассчитатьСуммыВВалютеОплаты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
			
	// Определяем, какой использован счет внутреннего учета: ДУ или СОБ	
	РаботаСДокументамиКлиентСервер.ЗаполнитьВидСчетаВнутреннегоУчета(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнебиржеваяСделкаПриИзменении(Элемент)
	
	Если ЭтаФорма.ВнебиржеваяСделка Тогда
		
		Объект.МестоХранения		= ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");
		Объект.ДатаИсполнения		= Объект.Дата;
		Объект.ОтложенноеИсполнение = Истина;
		ЭтаФорма.ВариантыОплатыТорговойКомиссииБезДаты = 1;
		ЭтаФорма.ВариантОплатыТорговойКомиссииСДатой   = 0;
		Объект.ОтложеннаяОплатаТорговойКомиссии        = Ложь;
		
	Иначе
		
		Объект.ВыкупЭмитентом       = Ложь;
		Объект.ОтложенноеИсполнение = Ложь;
		Объект.РаздельноеИсполнение = Ложь;
		Объект.МестоХранения        = Неопределено;
		ЗаполнитьОписаниеРеквизитовБиржевойСделки(ЭтаФорма, Объект);
		
	КонецЕсли;
	
	РасчетныйСчетПриИзменении(Неопределено);
	ВалютаПриИзменении(Неопределено);
	ОтложенноеИсполнениеПриИзменении(Неопределено);
	
	Если Не Элемент = Неопределено Тогда
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РынокПриИзменении(Элемент)
	
	Если Объект.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи") Тогда
		Объект.ПриобретениеПаев = Ложь;
	КонецЕсли;
	
	Если Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Доли") Тогда
		
		ВнебиржеваяСделка = Истина;
		ВнебиржеваяСделкаПриИзменении(Неопределено);
		СделкаЧерезБрокера = 0;
		СделкаЧерезБрокераПриИзменении(Неопределено);
		Объект.РасчетныйСчет = Неопределено;
		РасчетныйСчетПриИзменении(Неопределено);
		
	КонецЕсли;
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ПриИзмененииРынка(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура СделкаЧерезБрокераПриИзменении(Элемент)
	
	Объект.РасчетныйСчет = Неопределено; // т.к. связь параметров выбора не отрабатывает при программном изменении брокера
	
	БрокерПриИзменении(Неопределено);
	
	Если Не Элемент = Неопределено Тогда 			
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	Если СделкаЧерезБрокера = 0 Тогда
		Объект.Брокер = Неопределено;
	КонецЕсли;
	
	ЭтаФорма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Новый Структура("Дата, Организация, Брокер", Объект.Дата, Объект.Организация, Объект.Брокер));
	
	Если Не Элемент = Неопределено Тогда 			
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Объект.ВалютаОплаты <> ВалютаРасчетногоСчета Тогда
		Объект.ВалютаОплаты = ВалютаРасчетногоСчета;
	КонецЕсли;
	
	Если Не ЭтаФорма.ВнебиржеваяСделка И Объект.ВалютаСделки <> ВалютаРасчетногоСчета Тогда
		Объект.ВалютаСделки = Неопределено;
	КонецЕсли;
	
	Если Не Элемент = Неопределено Тогда
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложенноеИсполнениеПриИзменении(Элемент)
	
	Если Не Объект.ОтложенноеИсполнение Тогда
		Объект.РаздельноеИсполнение = Ложь;
	КонецЕсли;
	
	Если Не Элемент = Неопределено Тогда
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаздельноеИсполнениеПриИзменении(Элемент)
	
	Если Объект.РаздельноеИсполнение Тогда
		Объект.ДатаОплаты     = Объект.ДатаИсполнения;
		Объект.ДатаПоставки   = Объект.ДатаИсполнения;
	Иначе
		Объект.ДатаИсполнения = Макс(Объект.ДатаОплаты, Объект.ДатаПоставки);
	КонецЕсли;
	
	Если Объект.РаздельноеИсполнение И Не ЗначениеЗаполнено(Объект.ВалютаОплаты) Тогда
		Объект.ВалютаОплаты = Объект.ВалютаСделки;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОплатыТорговойКомиссииБезДатыПриИзменении(Элемент)
	
	ЭтаФорма.ВариантОплатыТорговойКомиссииСДатой = 0;
	
	Объект.ОтложеннаяОплатаТорговойКомиссии = Ложь;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОплатыТорговойКомиссииСДатойПриИзменении(Элемент)
	
	ЭтаФорма.ВариантыОплатыТорговойКомиссииБезДаты = 0;
	
	Объект.ОтложеннаяОплатаТорговойКомиссии = Истина;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВалютаСделки) Тогда
		ЭтаФорма.Элементы.ГруппаВВалютеСделки.Заголовок = "В валюте сделки (" + Объект.ВалютаСделки + ")";		
	КонецЕсли;
	
	Если Не ЭтаФорма.ВнебиржеваяСделка Тогда //для биржевой сделки заполняем значение валюты оплаты и делаем недоступным
		Объект.ВалютаОплаты = Объект.ВалютаСделки;
	КонецЕсли;
		
	РассчитатьСуммыВВалютеОплаты(ЭтаФорма);
	
	Если Не Элемент = Неопределено Тогда
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
 		
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОплатыПриИзменении(Элемент)
	
	РассчитатьСуммыВВалютеОплаты(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Объект.ВалютаОплаты) Тогда
		ЭтаФорма.Элементы.ГруппаСуммыВВалютеОплаты.Заголовок = "В валюте оплаты (" + Объект.ВалютаОплаты + ")";	
	КонецЕсли;
		
	Если Не Элемент = Неопределено Тогда
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобственныйКурсОплатыПриИзменении(Элемент)
	
	Объект.КурсОплаты = ?(Объект.СобственныйКурсОплаты, 1, Объект.Дата);
	
	РассчитатьСуммыВВалютеОплаты(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсОплатыПриИзменении(Элемент)
	
	РассчитатьСуммыВВалютеОплаты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦеннаяБумага1ПриИзменении(Элемент)
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиКоличество1ПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Количество", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦена1ПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Цена", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦенаПроцент1ПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "ЦенаПроцент", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦенаКупона1ПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "ЦенаКупона", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСумма1ПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Сумма", Объект.ВалютаСделки);
	
	РассчитатьСуммыВВалютеОплаты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСуммаКупона1ПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "СуммаКупона", Объект.ВалютаСделки);
	
	РассчитатьСуммыВВалютеОплаты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСделкиПриИзменении(Элемент)
	
	Если Объект.ВидСделки <> ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
		Объект.ПриобретениеПаев = Ложь;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаСделкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЭтаФорма.ВнебиржеваяСделка Тогда
		РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.ВалютаСделки, Объект.РасчетныйСчет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.ВалютаОплаты, Объект.РасчетныйСчет);
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ТЧ_ЦЕННЫЕ_БУМАГИ

&НаКлиенте
Процедура ЦенныеБумагиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ПриИзменении(ЭтаФорма,, НоваяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиПослеУдаления(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ПриИзменении(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦеннаяБумагаПриИзменении(Элемент)
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере(Элементы.ЦенныеБумаги.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиКоличествоПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Количество", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦенаПроцентПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "ЦенаПроцент", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦенаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Цена", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦенаКупонаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "ЦенаКупона", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСуммаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Сумма", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСуммаКупонаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "СуммаКупона", Объект.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаПроверитьЭСПНаРыночность(Команда)
	
	Если Объект.ВидСделки <> ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета доступна только для вида сделки: ""Покупка""");
		Возврат;
	ИначеЕсли Объект.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета доступна только для облигаций");
		Возврат;
	КонецЕсли; 
	
	Отчет = ПроверитьЭСПНаРыночностьСервере();
	
	Если Отчет <> Неопределено Тогда
		Отчет.Показать("ПроверкаЭСП");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаРасчета(Команда)
	
	РаботаСФормамиКлиент.РасшифроватьРасчетПроцентныхПоказателей(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКорзинаЦенныхБумаг(Команда)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ИзменитьРежим(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьРеквизитыБиржевойСделки(Команда)
	
	ПараметрыФормы = Новый Структура("МестоХранения, НомерСделки, ВремяСделки, КодРасчетовНаБирже, НеполныеЛоты, РежимПереговорныхСделок, КонтрагентНаБирже, ВыкупЭмитентом, ПервичноеРазмещение, РежимБиржевыхТоргов");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Объект);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ЭтаФорма.ТолькоПросмотр);
	
	НовыеЗнчРеквизитовБиржевойСделки = ОткрытьФормуМодально("Документ.Сделка.Форма.РеквизитыБиржевойСделки", ПараметрыФормы, ЭтаФорма);
	
	Если Не ЭтаФорма.ТолькоПросмотр Тогда
		
		Если ТипЗнч(НовыеЗнчРеквизитовБиржевойСделки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Объект, НовыеЗнчРеквизитовБиржевойСделки);
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
	
		ЗаполнитьОписаниеРеквизитовБиржевойСделки(ЭтаФорма, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоЦеннымБумагам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоЦеннымБумагам(ЭтаФорма, ЭтаФорма.СделкаЧерезБрокера, "ЦенныеБумаги");
	
	БрокерПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, ЭтаФорма.СделкаЧерезБрокера);
	
	РасчетныйСчетПриИзменении(ЭтаФорма.Элементы.РасчетныйСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаРаскрытыйКонтрагентНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ЭтаФорма.РаскрытыйКонтрагент) Тогда
		
		СписокДействий = Новый СписокЗначений();
		СписокДействий.Добавить("Открыть");
		СписокДействий.Добавить("Изменить");
		СписокДействий.Добавить("Очистить");
		
		Действие = ЭтаФорма.ВыбратьИзМеню(СписокДействий, ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент);
		
		Если Действие = Неопределено Тогда
			
			Возврат;
			
		ИначеЕсли Действие.Значение = "Открыть" Тогда
			ОткрытьЗначение(ЭтаФорма.РаскрытыйКонтрагент);
			
		ИначеЕсли Действие.Значение = "Изменить" Тогда
			
			Если ВвестиЗначение(ЭтаФорма.РаскрытыйКонтрагент, "Раскрытый контрагент", Тип("СправочникСсылка.ЮрФизЛица")) Тогда
				
				Если Не Объект.Ссылка.Пустая() Тогда
					РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Объект.Ссылка, "_РаскрытыйКонтрагент", ЭтаФорма.РаскрытыйКонтрагент);
				КонецЕсли;
												
			КонецЕсли;
						
		ИначеЕсли Действие.Значение = "Очистить" Тогда
			
			ЭтаФорма.РаскрытыйКонтрагент = Неопределено;
			
			Если Не Объект.Ссылка.Пустая() Тогда
				РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Объект.Ссылка, "_РаскрытыйКонтрагент", ЭтаФорма.РаскрытыйКонтрагент);
			КонецЕсли;
	
		КонецЕсли;
		
	Иначе
			
		Если ВвестиЗначение(ЭтаФорма.РаскрытыйКонтрагент, "Раскрытый контрагент", Тип("СправочникСсылка.ЮрФизЛица")) Тогда
			
			Если Не Объект.Ссылка.Пустая() Тогда
				РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Объект.Ссылка, "_РаскрытыйКонтрагент", ЭтаФорма.РаскрытыйКонтрагент);
			КонецЕсли;
								
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.РаскрытыйКонтрагент) Тогда
		ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = ЭтаФорма.РаскрытыйКонтрагент;
	Иначе
		ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = "Выбрать";	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РасчетЭСПвExcel(Команда)
	
	Если Объект.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Только для облигаций!");
		Возврат;
	КонецЕсли;
	
	БухгалтерскийУчетКлиентСервер.РасчетЭСПвExcel(
		ЭтаФорма.ЦенныеБумагиЦеннаяБумага1,
		Новый Структура("Дата, Организация, СчетДоверительногоУправления, УчетныйАктивЕПС, Партия, СтрокаПартии", 
			Объект.Дата, 
			Объект.Организация, 
			Объект.СчетДоверительногоУправления,
			ПредопределенноеЗначение("Справочник.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияРФ"), // специально ставлю АСный актив, что бы была возможность посчитать ЭСП для ССных бумаг
			Объект.Ссылка,
			1),
		Новый Структура("ДатаПокупки, ЦенаПокупки, ЦенаПокупкиКупона, Количество", 
			?(Объект.ОтложенноеИсполнение, Объект.ДатаИсполнения, НачалоДня(Объект.Дата)), 
			ЭтаФорма.ЦенныеБумагиЦена1 + БухгалтерскийУчетЕПС.ОпределитьСуммуРасходовПопадающуюВСтоимостьБумаги(Объект.Ссылка) / ЭтаФорма.ЦенныеБумагиКоличество1, 
			ЭтаФорма.ЦенныеБумагиЦенаКупона1, 
			ЭтаФорма.ЦенныеБумагиКоличество1)
	);
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаРасчетаССНаСервере(РасшифровкаРасчета)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьРыночнуюСтоимостьЦенныхБумаг(Объект, "ЦенныеБумаги", АдресТаблицыСтоимостей, 0, , , РасшифровкаРасчета);
	
	Если РасшифровкаРасчета.Операции.Количество() = 0 Тогда
		
		РасшифровкаРасчета = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета стоимости для варианта '" + РасшифровкаРасчета.ВариантРасчетаОценочнойСтоимости + "' не реализована");	

	Иначе

		Отчет = Новый ТабличныйДокумент;
		
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("Вариант расчета справедливой стоимости: " + РасшифровкаРасчета.ВариантРасчетаОценочнойСтоимости, , , Отчет);
		ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
		РаботаСДокументами.СформироватьРасшифровкуОперации(РасшифровкаРасчета, ПараметрыВывода);
		
		РасшифровкаРасчета = Отчет;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаРасчетаСС(Команда)
	
	Отказ = Ложь;	
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ЦенныеБумагиЦеннаяБумага1) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для расшифровки", , "ЦеннаяБумага1");
		Возврат;
	КонецЕсли;
	
	// Формируем расшифровку расчета
	
	РасшифровкаРасчета = Новый Структура;
	РасшифровкаРасчета.Вставить("ЦеннаяБумага",	ЭтаФорма.ЦенныеБумагиЦеннаяБумага1);
	РасшифровкаРасчета.Вставить("Операции",		Новый Массив);
	
	ОшибкаРасчетаРыночнойСтоимости = Ложь;
	
	ЦельРасчета				= ПредопределенноеЗначение("Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении");
	НастройкиОценки			= РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, ЦельРасчета);
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + ЦельРасчета + "'", , , , ОшибкаРасчетаРыночнойСтоимости);
		
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом") Тогда
		
		Если Не ЭтоАдресВременногоХранилища(АдресТаблицыСтоимостей) Тогда
			АдресТаблицыСтоимостей = РаботаСВнешнимиСистемамиКлиентСервер.ВыбратьФайлОценочнойСтоимостиПредоставленнойКлиентом(
				Объект.СчетДоверительногоУправления, Объект.Дата, Ложь, ЭтаФорма.УникальныйИдентификатор);
			Если Не ЭтоАдресВременногоХранилища(АдресТаблицыСтоимостей) Тогда
				ОшибкаРасчетаРыночнойСтоимости = Истина;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		АдресТаблицыСтоимостей = Неопределено;
		
	КонецЕсли;
	
	Если ОшибкаРасчетаРыночнойСтоимости Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рыночная стоимость не рассчитана.", , , , Отказ);		
		Возврат;
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаРасчета.Вставить("ВариантРасчетаОценочнойСтоимости", НастройкиОценки.ВариантРасчетаОценочнойСтоимости);	
	КонецЕсли;
	
	// Пересчет рыночной стоимости

	РасшифровкаРасчетаССНаСервере(РасшифровкаРасчета);
	
	Если ТипЗнч(РасшифровкаРасчета) = Тип("ТабличныйДокумент") Тогда
		РасшифровкаРасчета.Показать("Расчет стоимости '" + Строка(ЭтаФорма.ЦенныеБумагиЦеннаяБумага1) + "'");		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЭСПНаРыночностьСервере()
	
	ДатаПереоценки = НачалоДня(Объект.Дата);
	
	ОбщаяСумма = ЭтаФорма.ЦенныеБумагиСуммаВсего1 + БухгалтерскийУчетЕПС.ОпределитьСуммуРасходовПопадающуюВСтоимостьБумаги(Объект.Ссылка);
	ЦенаПриобретения = ОбщаяСумма / ЭтаФорма.ЦенныеБумагиКоличество1;
	
	Облигация = ЭтаФорма.ЦенныеБумагиЦеннаяБумага1;
	
	ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
	ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ВидУчета);
	НастройкиЦелиРасчета = БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(ДатаПереоценки, Объект.Организация, Объект.СчетДоверительногоУправления, ЦельРасчета);
	ВариантРасчетаОценочнойСтоимости = НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости;
	
	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("Организация",							Объект.Организация);
	ПараметрыОценки.Вставить("СчетДоверительногоУправления",		Объект.СчетДоверительногоУправления);
	ПараметрыОценки.Вставить("ВидУчета",							ВидУчета);
	ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости",	ВариантРасчетаОценочнойСтоимости);
	ПараметрыОценки.Вставить("Клиент",								Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, ДатаПереоценки));
	ПараметрыОценки.Вставить("ПараметрыПолученияПартий",			РаботаСПереоценкой.ПолучитьПараметрыПолученияПартийПоМетодике(ЦельРасчета, ВидУчета, ВариантРасчетаОценочнойСтоимости, ДатаПереоценки));
	
	Отказ = Ложь;
	
	ПараметрыДенежногоПотока = РаботаСПереоценкой.ПолучитьПараметрыДенежногоПотока(ПараметрыОценки, ДатаПереоценки, Облигация, Отказ);
	Если Отказ Тогда
	    Возврат Неопределено;
	КонецЕсли;
	
	ДоходностьДюрация = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
							Облигация,
							ПараметрыДенежногоПотока.ДоДатыПогашения,
							ДатаПереоценки,
							ЦенаПриобретения,
							Объект.СчетДоверительногоУправления,
							ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	
	Если ТипЗнч(ДоходностьДюрация) = Тип("Структура") Тогда
		
		ЭСП = ДоходностьДюрация.Доходность;
		
		НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаПереоценки, Объект.Организация, Объект.СчетДоверительногоУправления);
		Если НастройкиУчета.РазрядностьОкругленияЭСП > 0 Тогда
			ЭСП = Окр(ЭСП, НастройкиУчета.РазрядностьОкругленияЭСП);
		Иначе
			ЭСП = Метаданные.ОпределяемыеТипы.ЭффективнаяПроцентнаяСтавка.Тип.ПривестиЗначение(ЭСП);	
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	Отчет = Новый ТабличныйДокумент;
	
	ПараметрыПроверки = Новый Структура("НомерСтроки, ЦеннаяБумага, Партия, СтрокаПартии, ЦенаПокупки, НоминалТекущий", 1, Облигация, Объект.Ссылка, 1, ЦенныеБумагиСумма1/ЦенныеБумагиКоличество1, ЦенныеБумагиНоминал1);
	
	Если БухгалтерскийУчетЕПС.ПроверитьЭСПНаРыночность(Облигация, ЭСП, ДатаПереоценки, Объект.СчетДоверительногоУправления, Отчет, ПараметрыПроверки, Отказ) <> Неопределено Тогда
		Возврат Отчет;
	КонецЕсли;
	
КонецФункции
